# IFCLinkDocumentExportScope Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLinkDocumentExportScope Constructor
IFCLinkDocumentExportScope Class See Also
---
Instantiates a default IFCLinkDocumentExportScope object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IFCLinkDocumentExportScope(
	Document pADoc
)
```

Visual Basic
---
```text
Public Sub New ( _
	pADoc As Document _
)
```

Visual C++
---
```text
public:
IFCLinkDocumentExportScope(
	Document^ pADoc
)
```

# ### Parameters
pADoc
    Type: Autodesk.Revit.DB..::..Document The linked document to export.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace